# Реализуйте алгоритм сортировки списка из чисел по возрастанию.


# Принимаем на вход список чисел и сортируем его по возрастанию
num_list = [-10, 10, -5, 5, -2.5, 2.5, 0]
print (f"До сортировки: {num_list}")
num_list.sort()
print (f"После сортировки: {num_list}")