# Реализуйте алгоритм сортировки списка из чисел по возрастанию.


# Принятие на вход списка чисел и его сортировка по возрастанию.
num_list = [-10, 10, -5, 5, -2.5, 2.5, 0]
print (f"До сортировки: {num_list}")
num_list.sort()
print (f"После сортировки: {num_list}")